keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSmu_bf.h
/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS2 */
#define IFX_SMU_RMSTS_STS2_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS2 */
#define IFX_SMU_RMSTS_STS2_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS2 */
#define IFX_SMU_RMSTS_STS2_OFF (2)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS30 */
#define IFX_SMU_RMSTS_STS30_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS30 */
#define IFX_SMU_RMSTS_STS30_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS30 */
#define IFX_SMU_RMSTS_STS30_OFF (30)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS31 */
#define IFX_SMU_RMSTS_STS31_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS31 */
#define IFX_SMU_RMSTS_STS31_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS31 */
#define IFX_SMU_RMSTS_STS31_OFF (31)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS3 */
#define IFX_SMU_RMSTS_STS3_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS3 */
#define IFX_SMU_RMSTS_STS3_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS3 */
#define IFX_SMU_RMSTS_STS3_OFF (3)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS4 */
#define IFX_SMU_RMSTS_STS4_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS4 */
#define IFX_SMU_RMSTS_STS4_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS4 */
#define IFX_SMU_RMSTS_STS4_OFF (4)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS5 */
#define IFX_SMU_RMSTS_STS5_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS5 */
#define IFX_SMU_RMSTS_STS5_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS5 */
#define IFX_SMU_RMSTS_STS5_OFF (5)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS6 */
#define IFX_SMU_RMSTS_STS6_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS6 */
#define IFX_SMU_RMSTS_STS6_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS6 */
#define IFX_SMU_RMSTS_STS6_OFF (6)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS7 */
#define IFX_SMU_RMSTS_STS7_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS7 */
#define IFX_SMU_RMSTS_STS7_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS7 */
#define IFX_SMU_RMSTS_STS7_OFF (7)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS8 */
#define IFX_SMU_RMSTS_STS8_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS8 */
#define IFX_SMU_RMSTS_STS8_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS8 */
#define IFX_SMU_RMSTS_STS8_OFF (8)

/** \\brief  Length for Ifx_SMU_RMSTS_Bits.STS9 */
#define IFX_SMU_RMSTS_STS9_LEN (1)

/** \\brief  Mask for Ifx_SMU_RMSTS_Bits.STS9 */
#define IFX_SMU_RMSTS_STS9_MSK (0x1)

/** \\brief  Offset for Ifx_SMU_RMSTS_Bits.STS9 */
#define IFX_SMU_RMSTS_STS9_OFF (9)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.ALID0 */
#define IFX_SMU_RTAC0_ALID0_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.ALID0 */
#define IFX_SMU_RTAC0_ALID0_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.ALID0 */
#define IFX_SMU_RTAC0_ALID0_OFF (3)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.ALID1 */
#define IFX_SMU_RTAC0_ALID1_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.ALID1 */
#define IFX_SMU_RTAC0_ALID1_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.ALID1 */
#define IFX_SMU_RTAC0_ALID1_OFF (11)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.ALID2 */
#define IFX_SMU_RTAC0_ALID2_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.ALID2 */
#define IFX_SMU_RTAC0_ALID2_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.ALID2 */
#define IFX_SMU_RTAC0_ALID2_OFF (19)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.ALID3 */
#define IFX_SMU_RTAC0_ALID3_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.ALID3 */
#define IFX_SMU_RTAC0_ALID3_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.ALID3 */
#define IFX_SMU_RTAC0_ALID3_OFF (27)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.GID0 */
#define IFX_SMU_RTAC0_GID0_LEN (3)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.GID0 */
#define IFX_SMU_RTAC0_GID0_MSK (0x7)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.GID0 */
#define IFX_SMU_RTAC0_GID0_OFF (0)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.GID1 */
#define IFX_SMU_RTAC0_GID1_LEN (3)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.GID1 */
#define IFX_SMU_RTAC0_GID1_MSK (0x7)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.GID1 */
#define IFX_SMU_RTAC0_GID1_OFF (8)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.GID2 */
#define IFX_SMU_RTAC0_GID2_LEN (3)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.GID2 */
#define IFX_SMU_RTAC0_GID2_MSK (0x7)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.GID2 */
#define IFX_SMU_RTAC0_GID2_OFF (16)

/** \\brief  Length for Ifx_SMU_RTAC0_Bits.GID3 */
#define IFX_SMU_RTAC0_GID3_LEN (3)

/** \\brief  Mask for Ifx_SMU_RTAC0_Bits.GID3 */
#define IFX_SMU_RTAC0_GID3_MSK (0x7)

/** \\brief  Offset for Ifx_SMU_RTAC0_Bits.GID3 */
#define IFX_SMU_RTAC0_GID3_OFF (24)

/** \\brief  Length for Ifx_SMU_RTAC1_Bits.ALID0 */
#define IFX_SMU_RTAC1_ALID0_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC1_Bits.ALID0 */
#define IFX_SMU_RTAC1_ALID0_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC1_Bits.ALID0 */
#define IFX_SMU_RTAC1_ALID0_OFF (3)

/** \\brief  Length for Ifx_SMU_RTAC1_Bits.ALID1 */
#define IFX_SMU_RTAC1_ALID1_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC1_Bits.ALID1 */
#define IFX_SMU_RTAC1_ALID1_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC1_Bits.ALID1 */
#define IFX_SMU_RTAC1_ALID1_OFF (11)

/** \\brief  Length for Ifx_SMU_RTAC1_Bits.ALID2 */
#define IFX_SMU_RTAC1_ALID2_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC1_Bits.ALID2 */
#define IFX_SMU_RTAC1_ALID2_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC1_Bits.ALID2 */
#define IFX_SMU_RTAC1_ALID2_OFF (19)

/** \\brief  Length for Ifx_SMU_RTAC1_Bits.ALID3 */
#define IFX_SMU_RTAC1_ALID3_LEN (5)

/** \\brief  Mask for Ifx_SMU_RTAC1_Bits.ALID3 */
#define IFX_SMU_RTAC1_ALID3_MSK (0x1f)

/** \\brief  Offset for Ifx_SMU_RTAC1_Bits.ALID3 */
#define IFX_SMU_RTAC1_ALID3_OFF (27)

/** \\brief  Length for Ifx_SMU_RTAC1_Bits.GID0 */
#define IFX_SMU_RTAC1_GID0_LEN (3)

